let TopSenders = 
    EmailEvents
    | where Timestamp > ago(30d)
    | summarize TotalEmails = count() by SenderMailFromAddress
    | top 10 by TotalEmails;
EmailEvents
| where Timestamp > ago(30d)
| where SenderMailFromAddress in (TopSenders)
| summarize EmailCount = count() by SenderMailFromAddress, Day = bin(Timestamp, 1d)
| order by SenderMailFromAddress asc, Day desc
